ubirch/ubirch-kinetis-sdk/SDK_2.0_MKL82Z128xxx7/boards/twrkl82z72m/usb_examples/usb_device_ccid_smart_card/bm/smart_card.c
    switch (event)
    {
        case kUSB_DeviceCcidEventCommandReceived:
            /* Command received */
            error = USB_DeviceCcidCommandHandle(classHandle, callbackParam);
            break;
        case kUSB_DeviceCcidEventResponseSent:
            break;
        case kUSB_DeviceCcidEventGetSlotCount:
            if (callbackParam)
            {
                /* Get the slot count */
                temp8 = (uint8_t *)callbackParam;
                *temp8 = USB_DEVICE_CCID_SMART_CARD_MAX_SLOTS;
                error = kStatus_USB_Success;
            }
            break;
        case kUSB_DeviceCcidEventGetSlotStatus:
            if (callbackParam)
            {
                /* Get the slot status */
                usb_device_ccid_slot_status_struct_t *slotStatus;
                slotStatus = (usb_device_ccid_slot_status_struct_t *)callbackParam;
                if (USB_DEVICE_CCID_SMART_CARD_SLOT_INDEX == slotStatus->slot)
                {
                    slotStatus->clockStatus = g_UsbDeviceCcidSmartCard.clockStatus;
                    if (!g_UsbDeviceCcidSmartCard.present)
                    {
                        slotStatus->present = USB_DEVICE_CCID_SLOT_STATUS_ICC_NOT_PRESENT;
                    }
                    else
                    {
                        if (g_UsbDeviceCcidSmartCard.powerOn)
                        {
                            slotStatus->present = USB_DEVICE_CCID_SLOT_STATUS_ICC_PRESENT_ACTIVE;
                        }
                        else
                        {
                            slotStatus->present = USB_DEVICE_CCID_SLOT_STATUS_ICC_PRESENT_INACTIVE;
                        }
                    }
                    error = kStatus_USB_Success;
                }
            }
            break;
        case kUSB_DeviceCcidEventCommandAbort:
            break;
        case kUSB_DeviceCcidEventGetClockFrequencies:
            if (callbackParam)
            {
                controlRequest = (usb_device_ccid_control_request_struct_t *)callbackParam;
                controlRequest->buffer = (uint8_t *)&g_UsbDeviceCcidSmartCard.clockFrequency;
                controlRequest->length = sizeof(g_UsbDeviceCcidSmartCard.clockFrequency);
                error = kStatus_USB_Success;
            }
            break;
        case kUSB_DeviceCcidEventGetDataRate:
            if (callbackParam)
            {
                controlRequest = (usb_device_ccid_control_request_struct_t *)callbackParam;
                controlRequest->buffer = (uint8_t *)&g_UsbDeviceCcidSmartCard.dataRate;
                controlRequest->length = sizeof(g_UsbDeviceCcidSmartCard.dataRate);
                error = kStatus_USB_Success;
            }
            break;
        case kUSB_DeviceCcidEventSlotChangeSent:
            if (!g_UsbDeviceCcidSmartCard.present)
            {
                EMVL1_SmartCardPowerOff();
                g_UsbDeviceCcidSmartCard.powerOn = 0U;
            }
            error = kStatus_USB_Success;
            break;
        case kUSB_DeviceCcidEventHardwareErrorSent:
            break;
        default:
            break;
    }

    return error;
}

/* Device callback */
static usb_status_t USB_DeviceCallback(usb_device_handle handle, uint32_t event, void *param)
{
    usb_status_t error = kStatus_USB_Success;
    uint8_t *temp8 = (uint8_t *)param;
    uint16_t *temp16 = (uint16_t *)param;

    switch (event)
    {
        case kUSB_DeviceEventBusReset:
        {
            /* USB device bus reset signal detected */
            g_UsbDeviceCcidSmartCard.attach = 0U;
            g_UsbDeviceCcidSmartCard.remoteWakeup = 0U;
            g_UsbDeviceCcidSmartCard.suspend = 0U;
            g_UsbDeviceCcidSmartCard.powerOn = 0U;
#if defined(USB_DEVICE_CONFIG_EHCI) && (USB_DEVICE_CONFIG_EHCI > 0U)
            if (kStatus_USB_Success == USB_DeviceGetStatus(g_UsbDeviceCcidSmartCard.deviceHandle,
                                                           kUSB_DeviceStatusSpeed, &g_UsbDeviceCcidSmartCard.speed))
            {
                USB_DeviceSetSpeed(g_UsbDeviceCcidSmartCard.speed);
            }
#endif
            error = kStatus_USB_Success;
        }
        break;

        case kUSB_DeviceEventSuspend:
        {
            /* USB device bus suspend signal detected */
            if (g_UsbDeviceCcidSmartCard.attach)
            {
                g_UsbDeviceCcidSmartCard.suspend = 1U;
                usb_echo("USB ccid device suspend\r\n");
                error = kStatus_USB_Success;
            }
        }
        break;
        case kUSB_DeviceEventResume:
        {
            /* USB device bus resume signal detected */
            if (g_UsbDeviceCcidSmartCard.attach)
            {
                g_UsbDeviceCcidSmartCard.suspend = 0U;
                usb_echo("USB ccid device resume\r\n");
                error = kStatus_USB_Success;
            }
        }
        break;
        case kUSB_DeviceEventSetRemoteWakeup:
            if (param)
            {
                if (g_UsbDeviceCcidSmartCard.attach)
                {
                    g_UsbDeviceCcidSmartCard.remoteWakeup = *temp8;
                    error = kStatus_USB_Success;
                }
            }
            break;
        case kUSB_DeviceEventSetConfiguration:
            if (USB_DEVICE_CCID_SMART_CARD_CONFIGURE_INDEX == (*temp8))
            {
                g_UsbDeviceCcidSmartCard.attach = 1U;
                g_UsbDeviceCcidSmartCard.currentConfiguration = *temp8;
                error = kStatus_USB_Success;
            }
            break;
        case kUSB_DeviceEventSetInterface:
            if (g_UsbDeviceCcidSmartCard.attach)
            {
                uint8_t interface = (uint8_t)((*temp16 & 0xFF00U) >> 0x08U);
                uint8_t alternateSetting = (uint8_t)(*temp16 & 0x00FFU);
                if (interface < USB_DEVICE_CCID_SMART_CARD_INTERFACE_COUNT)
                {
                    g_UsbDeviceCcidSmartCard.currentInterfaceAlternateSetting[interface] = alternateSetting;
                    error = kStatus_USB_Success;
                }
                else
                {
                    error = kStatus_USB_InvalidRequest;
                }
            }
            break;
        case kUSB_DeviceEventGetConfiguration:
            if (param)
            {
                *temp8 = g_UsbDeviceCcidSmartCard.currentConfiguration;
                error = kStatus_USB_Success;
            }
            break;
        case kUSB_DeviceEventGetInterface:
            if (param)
            {
                uint8_t interface = (uint8_t)((*temp16 & 0xFF00U) >> 0x08U);
                if (interface < USB_DEVICE_CCID_SMART_CARD_INTERFACE_COUNT)
                {
                    *temp16 =
                        (*temp16 & 0xFF00U) | g_UsbDeviceCcidSmartCard.currentInterfaceAlternateSetting[interface];
                    error = kStatus_USB_Success;
                }
                else
                {
                    error = kStatus_USB_InvalidRequest;
                }
            }
            break;
        case kUSB_DeviceEventGetDeviceDescriptor:
            if (param)
            {
                error = USB_DeviceGetDeviceDescriptor(handle, (usb_device_get_device_descriptor_struct_t *)param);
            }
            break;
        case kUSB_DeviceEventGetConfigurationDescriptor:
            if (param)
            {
                error = USB_DeviceGetConfigurationDescriptor(handle,
                                                             (usb_device_get_configuration_descriptor_struct_t *)param);
            }
            break;
        case kUSB_DeviceEventGetStringDescriptor:
            if (param)
            {
                error = USB_DeviceGetStringDescriptor(handle, (usb_device_get_string_descriptor_struct_t *)param);
            }
            break;
        default:
            break;
    }

    return error;
}

#if defined(USB_DEVICE_CONFIG_EHCI) && (USB_DEVICE_CONFIG_EHCI > 0U)
void USBHS_IRQHandler(void)
{
    USB_DeviceEhciIsrFunction(g_UsbDeviceCcidSmartCard.deviceHandle);
}
#endif
#if defined(USB_DEVICE_CONFIG_KHCI) && (USB_DEVICE_CONFIG_KHCI > 0U)
void USB0_IRQHandler(void)
{
    USB_DeviceKhciIsrFunction(g_UsbDeviceCcidSmartCard.deviceHandle);
}
#endif

/* the slot changed callback */
static void EMVL1_CcidCallback(uint8_t event, void *buffer, uint32_t size)
{
    switch (event)
    {
        case kEmvSmartCardEventCardInserted:
            g_UsbDeviceCcidSmartCard.present = 1U;
            if (g_UsbDeviceCcidSmartCard.attach)
            {
                if ((g_UsbDeviceCcidSmartCard.suspend) && (g_UsbDeviceCcidSmartCard.remoteWakeup))
                {
                    USB_DeviceSetStatus(g_UsbDeviceCcidSmartCard.deviceHandle, kUSB_DeviceStatusBus, NULL);
                }
            }
            USB_DeviceCcidNotifySlotChange(g_UsbDeviceCcidSmartCard.classHandle, USB_DEVICE_CCID_SMART_CARD_SLOT_INDEX,
                                           kUSB_DeviceCcidSlotStatePresent);
            usb_echo("CCID card is inserted!\r\n");
            break;
        case kEmvSmartCardEventCardRemoved:
            g_UsbDeviceCcidSmartCard.present = 0U;
            g_UsbDeviceCcidSmartCard.clockStatus = USB_DEVICE_CCID_CLCOK_STATUS_CLOCK_STOPPED_UNKNOWN;
            if (g_UsbDeviceCcidSmartCard.attach)
            {
                if ((g_UsbDeviceCcidSmartCard.suspend) && (g_UsbDeviceCcidSmartCard.remoteWakeup))
                {
                    USB_DeviceSetStatus(g_UsbDeviceCcidSmartCard.deviceHandle, kUSB_DeviceStatusBus, NULL);
                }
            }
            USB_DeviceCcidNotifySlotChange(g_UsbDeviceCcidSmartCard.classHandle, USB_DEVICE_CCID_SMART_CARD_SLOT_INDEX,
                                           kUSB_DeviceCcidSlotStateNoPresent);
            EMVL1_SmartCardPowerOff();
            usb_echo("CCID card is removed!\r\n");
            break;
        default:
            break;
    }
}

static void USB_DeviceApplicationInit(void)
{
    uint8_t irqNumber;
#if defined(USB_DEVICE_CONFIG_EHCI) && (USB_DEVICE_CONFIG_EHCI > 0U)
    uint8_t usbDeviceEhciIrq[] = USBHS_IRQS;
    irqNumber = usbDeviceEhciIrq[CONTROLLER_ID - kUSB_ControllerEhci0];

